package day0219.ex;

public class Ex03 {
/*
 		*메서드
 			- 클래스 변수의 값을 변경 하는 역할,
 				객체를 생성한 후 다양한 기능을 수행하는 역할.
 			- 객체간의 데이터를 전달의 수단으로 사용 됨.
 			- 외부로부터의 매개값을 받을 수 있고, 
 				실행 후 결과를 리턴 할 수 있다.
 			- 메서드는 호출(사용)한 곳으로 돌아온다.
 		
 		* 메서드 선언
 			선언부 구현부로 이루어져있음.
 			
 			리턴타입 메소드이름(매개변수, . . )//<선언부{
 				// 코드 구현부분		<구현부
 			}
 			- 리턴타입		:	메서드가 리턴하는 결과값의 타입.
 			- 메서드 이름	:	어떤 기능을 하는지 유추 가능한 이름 사용. 
 			- ()				:	메서드가 실행 할 때 필요한 데이터를 받기 위한 변수.
 			- {}				:	메서드의 실행 영역(블럭)
 			
 		* 리턴타입
 			- 메서드가 실행 한 후 결과값의 데이터(자료형)타입
 			- 실행한 후에 호출한곳으로 넘겨줄 값이 있는 경우
 			- 있는 경우 / 없는 경우
 					ex) powerOn() 전원을 키는 메서드
 							-> 전원만 켜면 끝.
 						 나누는 기능 divide() 메서드
 						 	-> 나눗셈의 결과값을 리턴.
 			
 */
}
