package day0216.ex;

public class Ex01 {
	public static void main(String[] args) {
		/* 객체
		 * 		- 눈에 보이지 모든 사물
		 * 		- 눈에 보이지 않는 것 들도 객체가 될 수 있다.
		 * 		ex) 로그인 주문 생산 관리 등 어떤 행동을 나타내는 것도 가능.
		 * 	
		 * 자바
		 * 		- 객체를 기반으로 하는 프로그래밍
		 * 		- 어떤 대상(객체)을 가지고 프로그래밍 한다.
		 * 		
		 * 언어의 특징
		 * 		- 절차 지향 언어
		 * 			-> 순서대로 일어나는 일을 시간순으로 프로그래밍 하는것.
		 * 			-> 직접 접근이 아닌 순차적으로 접근한다.
		 * 			-> 대표적인 언어 : C언어
		 * 		- 객체 지향 언어
		 * 			-> 객체를 정의하고 객체 간 협력을 프로그래밍하는것.
		 * 			-> 객체를 만들고  객체 사이에서 일어나는 일을 구현하는것.
		 * 		- 관점 지향 언어
		 * 			-> 기술구별이 아닌 개념적인 구별이다.
		 * 			-> 목적이 아니라 사용에 따라 다르게 쓰인다.
		 */	
	}
}
